In [1]:
import pandas as pd
import numpy as np
import re

In [30]:
df_f = pd.read_csv("./data/부마데이터(최종).csv", encoding ="cp949")

In [31]:
df_f

          마번               마명          부마성적
0      15477               백광   25전(11/8/3)
1      15625               홍지  44전(12/13/5)
2      18206            엑스플로잇     6전(5/1/0)
3      18733           비와신세이키   33전(10/7/8)
4      18771           캐피털스팬딩    12전(2/4/1)
..       ...              ...           ...
244  6992422      SKY KINGDOM    21전(6/2/4)
245  6993812   CENTRAL BANKER    13전(4/3/2)
246  6994066         TAMARKUZ    20전(8/4/0)
247  6995237  BIG BLUE KITTEN   33전(14/8/5)
248  6995985       BAL A BALI   26전(15/1/4)

[249 rows x 3 columns]

In [32]:
df_f.drop(columns='마번', inplace=True)

In [33]:
df_f

                  마명          부마성적
0                 백광   25전(11/8/3)
1                 홍지  44전(12/13/5)
2              엑스플로잇     6전(5/1/0)
3             비와신세이키   33전(10/7/8)
4             캐피털스팬딩    12전(2/4/1)
..               ...           ...
244      SKY KINGDOM    21전(6/2/4)
245   CENTRAL BANKER    13전(4/3/2)
246         TAMARKUZ    20전(8/4/0)
247  BIG BLUE KITTEN   33전(14/8/5)
248       BAL A BALI   26전(15/1/4)

[249 rows x 2 columns]

In [21]:
# 부마전적 컬럼 숫자 분리
temp1 = df_f.loc[:,"부마성적"].apply(lambda x: re.sub(r"[^0-9]", " ", x).split())
temp1

0       [25, 11, 8, 3]
1      [44, 12, 13, 5]
2         [6, 5, 1, 0]
3       [33, 10, 7, 8]
4        [12, 2, 4, 1]
            ...
244      [21, 6, 2, 4]
245      [13, 4, 3, 2]
246      [20, 8, 4, 0]
247     [33, 14, 8, 5]
248     [26, 15, 1, 4]
Name: 부마성적, Length: 249, dtype: object

In [22]:
# len이 다른게 발생
for i in range(len(temp1)):
    if len(temp1[i]) < 4:
        print(temp1[i], i)

['9', '3', '2'] 121

In [23]:
df_f.loc[121]

마명      GREENPOINTCRUSADER
부마성적              9전(3/2/)
Name: 121, dtype: object

In [24]:
# 결측값 0으로 채우기
temp1[121].append(0)
temp1[121]

['9', '3', '2', 0]

In [25]:
df_f['부마성적'] = temp1.apply(lambda x : int(x[1])*3 + int(x[2])*2 + int(x[3])*1  / int(x[0]) if x[0]!='0' else 0)
df_f

                  마명       부마성적
0                 백광  49.120000
1                 홍지  62.113636
2              엑스플로잇  17.000000
3             비와신세이키  44.242424
4             캐피털스팬딩  14.083333
..               ...        ...
244      SKY KINGDOM  22.190476
245   CENTRAL BANKER  18.153846
246         TAMARKUZ  32.000000
247  BIG BLUE KITTEN  58.151515
248       BAL A BALI  47.153846

[249 rows x 2 columns]

In [45]:
df_f.loc[248, :]

마명       BAL A BALI
부마성적    26전(15/1/4)
Name: 248, dtype: object